espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/micrium_os/drivers/fs/source/fs_nor_quad_spi_drv_silabs_efm32gg11.c
/***************************************************************************//**
 * @file
 * @brief File System - Efm32G11 Quad Spi Controller Driver
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc.  Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement.
 * The software is governed by the sections of the MSLA applicable to Micrium
 * Software.
 *
 ******************************************************************************/

/****************************************************************************************************//**
 * @note    (1) This driver does support:
 *             - (a) Memory mapped 'direct' mode of operation for performing flash data transfers and
 *                   executing code from flash memory.
 *             - (b) 'Indirect' mode of operation for performing low latency and non processor intensive
 *                   flash data transfers
 *             - (c) Software triggered instruction generator to perform flash commands accessing
 *                   flash device registers and erasing entire or parts of the flash device
 *             - (d) Polling-based data communication
 *
 * @note     (2) This driver does NOT support:
 *             - (a) Dual I/O data communication, that is commands 2READ and DREAD
 *             - (b) Interrupt-based data communication
 *******************************************************************************************************/

/********************************************************************************************************
 ********************************************************************************************************
 *                                       DEPENDENCIES & AVAIL CHECK(S)
 ********************************************************************************************************
 *******************************************************************************************************/

#include <rtos_description.h>

#if (defined(RTOS_MODULE_FS_STORAGE_NOR_AVAIL))

#if (!defined(RTOS_MODULE_FS_AVAIL))

#error NOR module requires File System Storage module. Make sure it is part of your project and that \
  RTOS_MODULE_FS_AVAIL is defined in rtos_description.h.

#endif

/********************************************************************************************************
 ********************************************************************************************************
 *                                               INCLUDE FILES
 ********************************************************************************************************
 *******************************************************************************************************/

#include  <cpu/include/cpu.h>
#include  <common/include/lib_mem.h>
#include  <common/include/lib_utils.h>
#include  <common/source/kal/kal_priv.h>
#include  <common/source/logging/logging_priv.h>

#include  <fs/include/fs_nor_quad_spi.h>

#include  <em_qspi.h>

/********************************************************************************************************
 ********************************************************************************************************
 *                                               LOCAL DEFINES
 *
 * Note(s) : (1) The QSPI controller defines the SRAMPARTITIONCFG register. This register allows to define
 *               the internal QSPI SRAM memory in two partitions: one for indirect read and the other for
 *               indirect write. The register has only one field defining the size of the indirect
 *               read partition in the SRAM, in units of SRAM locations (maximum 256 locations of 32-bit
 *               words).
 *
 *               +-----------------+
 *               |                 |
 *               | Indirect writes | UPPER PART
 *               |                 |     |
 *               +-----------------+     +--> register SRAMPARTITIONCFG
 *               |                 |     |
 *               | Indirect reads  | LOWER PART
 *               |                 |
 *               +-----------------+
 *
 *               The write partition size is basically:
 *
 *               Write partition size = SRAM total size - read partition size
 *
 *               For instance, if 'read partition size' = 32 locations then write partition size is :
 *               256 - 32 = 223 locations * 32-bit = 892 bytes
 *
 *               (a) The 1-KB SRAM FIFO of the QSPI controller includes one extra location for a 32-bit
 *                   register. This location should not be accounted for the total available size for
 *                   reads and writes. Also another extra location should be marked as reserved. If the
 *                   SRAM read or write partition size is equal to 256 locations and the transfer has the
 *                   same size, the QSPI controller does not update correctly the SRAMFILL register.
 *
 *           (2) QSPI is mapped to two different memory regions, one in code space and one in system
 *               space. Each region can be used both to write to and read from external flash in direct
 *               and indirect modes. Code space is recommended for code execution and system space for
 *               data storage. FS_QSPI_SRAM_FIFO_START_ADDR_SEL can be set to one of these two values:
 *
 *               QSPI0_MEM_BASE
 *               QSPI0_CODE_MEM_BASE
 ********************************************************************************************************
 *******************************************************************************************************/

#define  LOG_DFLT_CH                            (FS, DRV, NOR)
#define  RTOS_MODULE_CUR                        RTOS_CFG_MODULE_FS

#define  FS_QSPI_STIG_DATA_LEN_MAX                     8u       // STIG max data payload per instruction (i.e. command).
#define  FS_QSPI_DUMMY_CYCLES_PER_BYTE                 8u

#define  FS_QSPI_REG_RETRY1_MAX                        1000u
#define  FS_QSPI_REG_RETRY2_MAX                        100000u
#define  FS_QSPI_IDLE_CNT_MAX                          3u

//                                                                 Transfer mode.
#define  FS_QSPI_XFER_MODE_SINGLE_IO                   0u
#define  FS_QSPI_XFER_MODE_DUAL_IO                     1u
#define  FS_QSPI_XFER_MODE_QUAD_IO                     2u
#define  FS_QSPI_XFER_MODE_OCTAL_IO                    3u

//                                                                 QSPI SRAM cfg (see Note #1).
#define  FS_QSPI_SRAM_LOC_SIZE_BYTE                    4u
#define  FS_QSPI_SRAM_RESERVED_LOC_QTY                 2u       // See Note #1a.
#define  FS_QSPI_SRAM_MAX_LOC_QTY                      257u     // 257 entries of 32-bit (1028 total bytes).
#define  FS_QSPI_SRAM_SIZE_BYTE                        (FS_QSPI_SRAM_MAX_LOC_QTY * FS_QSPI_SRAM_LOC_SIZE_BYTE)

#define  FS_QSPI_SRAM_PARTITION_RD_SIZE_LOC_QTY        (FS_QSPI_SRAM_MAX_LOC_QTY - FS_QSPI_SRAM_RESERVED_LOC_QTY)
#define  FS_QSPI_SRAM_PARTITION_WR_SIZE_RD_LOC_QTY     1u
#define  FS_QSPI_SRAM_PARTITION_WR_SIZE_LOC_QTY_REAL   (FS_QSPI_SRAM_MAX_LOC_QTY - FS_QSPI_SRAM_PARTITION_WR_SIZE_RD_LOC_QTY)

//                                                                 QSPI memory space (see Note #2).
#define  FS_QSPI_SRAM_FIFO_START_ADDR_SEL              QSPI0_MEM_BASE

#define  FS_QSPI_EN_DELAY_MIN_mS                       10u
#define  FS_QSPI_4B_ALIGN_ADDR_MASK                    (CPU_WORD_SIZE_32 - 1u)

/********************************************************************************************************
 *                                           REGISTER BIT DEFINES
 *******************************************************************************************************/

//                                                                 ----------- QSPI CONFIGURATION REGISTER ------------
#define  FS_QSPI_REG_CONFIG_EN_MSK                             DEF_BIT_00
#define  FS_QSPI_REG_CONFIG_SEL_CLK_POL_MSK                    DEF_BIT_01
#define  FS_QSPI_REG_CONFIG_SEL_CLK_PHASE_MSK                  DEF_BIT_02
#define  FS_QSPI_REG_CONFIG_PHY_MODE_EN_MSK                    DEF_BIT_03
#define  FS_QSPI_REG_CONFIG_DAC_EN_MSK                         DEF_BIT_07
#define  FS_QSPI_REG_CONFIG_PERSELDEC_MSK                      DEF_BIT_09
#define  FS_QSPI_REG_CONFIG_PERCSLINES_MSK                     DEF_BIT_FIELD(2u, 10u)
#define  FS_QSPI_REG_CONFIG_AHB_REMAP_EN_MSK                   DEF_BIT_16
#define  FS_QSPI_REG_CONFIG_ENTER_XIP_IMM_MSK                  DEF_BIT_18
#define  FS_QSPI_REG_CONFIG_BAUDDIV_MSK                        DEF_BIT_FIELD(4u, 19u)
#define  FS_QSPI_REG_CONFIG_IDLE_MSK                           DEF_BIT_31
#define  FS_QSPI_REG_CONFIG_BAUDDIV_MIN                        2u
#define  FS_QSPI_REG_CONFIG_BAUDDIV_MAX                        32u
#define  FS_QSPI_REG_CONFIG_BAUDDIV_SDR_MIN                    4u
#define  FS_QSPI_REG_CONFIG_BAUDDIV_DDR_MIN                    8u
#define  FS_QSPI_REG_CONFIG_SEL_CLK_POL_OFFSET                 1u
#define  FS_QSPI_REG_CONFIG_SEL_CLK_PHASE_OFFSET               2u
#define  FS_QSPI_REG_CONFIG_PERCSLINES_OFFSET                  10u

//                                                                 -- DEVICE READ INSTRUCTION CONFIGURATION REGISTER --
#define  FS_QSPI_REG_DEVINSTRRDCONFIG_OPCODE_MSK               DEF_BIT_FIELD(8u, 0u)
#define  FS_QSPI_REG_DEVINSTRRDCONFIG_INST_WIDTH_MSK           DEF_BIT_FIELD(2u, 8u)
#define  FS_QSPI_REG_DEVINSTRRDCONFIG_ADDR_WIDTH_MSK           DEF_BIT_FIELD(2u, 12u)
#define  FS_QSPI_REG_DEVINSTRRDCONFIG_DATA_WIDTH_MSK           DEF_BIT_FIELD(2u, 16u)
#define  FS_QSPI_REG_DEVINSTRRDCONFIG_MODE_BITS_EN_MSK         DEF_BIT_20
#define  FS_QSPI_REG_DEVINSTRRDCONFIG_DUMMY_CLK_CYCLES_MSK     DEF_BIT_FIELD(5u, 24u)

