espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/micrium_os/drivers/fs/source/fs_nor_quad_spi_drv_silabs_efm32gg11.c
#define  FS_QSPI_REG_DEVINSTRRDCONFIG_DUMMY_CLK_CYCLES_MAX     31u

//                                                                 - DEVICE WRITE INSTRUCTION CONFIGURATION REGISTER --
#define  FS_QSPI_REG_DEVINSTRWRCONFIG_OPCODE_MSK               DEF_BIT_FIELD(8u, 0u)
#define  FS_QSPI_REG_DEVINSTRWRCONFIG_ADDR_WIDTH_MSK           DEF_BIT_FIELD(2u, 12u)
#define  FS_QSPI_REG_DEVINSTRWRCONFIG_DATA_WIDTH_MSK           DEF_BIT_FIELD(2u, 16u)
#define  FS_QSPI_REG_DEVINSTRWRCONFIG_DUMMY_CLK_CYCLES_MSK     DEF_BIT_FIELD(5u, 24u)

#define  FS_QSPI_REG_DEVINSTRWRCONFIG_DUMMY_CLK_CYCLES_MAX     31u

//                                                                 -------- DEVICE SIZE CONFIGURATION REGISTER --------
#define  FS_QSPI_REG_DEVSIZECONFIG_NBR_ADDR_MASK               DEF_BIT_FIELD(4u, 0u)
#define  FS_QSPI_REG_DEVSIZECONFIG_PAGE_SIZE_MASK              DEF_BIT_FIELD(12u, 4u)
#define  FS_QSPI_REG_DEVSIZECONFIG_SUBSECTOR_SIZE_MASK         DEF_BIT_FIELD(4u, 16u)
#define  FS_QSPI_REG_DEVSIZECONFIG_MEM_SIZE_CS0_MASK           DEF_BIT_FIELD(2u, 21u)
#define  FS_QSPI_REG_DEVSIZECONFIG_MEM_SIZE_CS1_MASK           DEF_BIT_FIELD(2u, 23u)

#define  FS_QSPI_REG_DEVSIZECONFIG_NBR_ADDR_OFFSET             0u
#define  FS_QSPI_REG_DEVSIZECONFIG_PAGE_SIZE_OFFSET            4u
#define  FS_QSPI_REG_DEVSIZECONFIG_SUBSECTOR_SIZE_OFFSET       16u

#define  FS_QSPI_REG_DEVSIZECONFIG_MEM_SIZE_CS_512Mb           0u
#define  FS_QSPI_REG_DEVSIZECONFIG_MEM_SIZE_CS_1Gb             1u
#define  FS_QSPI_REG_DEVSIZECONFIG_MEM_SIZE_CS_2Gb             2u
#define  FS_QSPI_REG_DEVSIZECONFIG_MEM_SIZE_CS_4Gb             3u

//                                                                 ------------ READ DATA CAPTURE REGISTER ------------
#define  FS_QSPI_REG_RDDATACAPTURE_DLY_MASK                    DEF_BIT_FIELD(4u, 1u)
#define  FS_QSPI_REG_RDDATACAPTURE_DLY_MAX                     16u

//                                                                 ---------------- SRAM FILL REGISTER ----------------
#define  FS_QSPI_REG_SRAMFILL_INDRDPART_MASK                   DEF_BIT_FIELD(16u, 0u)
#define  FS_QSPI_REG_SRAMFILL_INDWRPART_MASK                   DEF_BIT_FIELD(16u, 16u)
#define  FS_QSPI_REG_SRAMFILL_INDWRPART_OFFSET                 16u

//                                                                 ----- INDIRECT READ TRANSFER CONTROL REGISTER ------
#define  FS_QSPI_REG_INDIRECTREADXFERCTRL_START_MASK           DEF_BIT_00
#define  FS_QSPI_REG_INDIRECTREADXFERCTRL_CANCEL_MASK          DEF_BIT_01
#define  FS_QSPI_REG_INDIRECTREADXFERCTRL_SRAM_FULL_MASK       DEF_BIT_03
#define  FS_QSPI_REG_INDIRECTREADXFERCTRL_OP_DONE_MASK         DEF_BIT_05

//                                                                 ----- INDIRECT WRITE TRANSFER CONTROL REGISTER -----
#define  FS_QSPI_REG_INDIRECTWRITEXFERCTRL_START_MASK          DEF_BIT_00
#define  FS_QSPI_REG_INDIRECTWRITEXFERCTRL_CANCEL_MASK         DEF_BIT_01
#define  FS_QSPI_REG_INDIRECTWRITEXFERCTRL_OP_DONE_MASK        DEF_BIT_05

//                                                                 ---------- FLASH COMMAND CONTROL REGISTER ----------
#define  FS_QSPI_REG_FLASHCMDCTRL_EXEC_CMD_MASK                DEF_BIT_00
#define  FS_QSPI_REG_FLASHCMDCTRL_EXEC_CMD_STATUS_MASK         DEF_BIT_01
#define  FS_QSPI_REG_FLASHCMDCTRL_DUMMY_BYTES_MSK              DEF_BIT_FIELD(5u, 7u)
#define  FS_QSPI_REG_FLASHCMDCTRL_WR_DATA_BYTES_MSK            DEF_BIT_FIELD(3u, 12u)
#define  FS_QSPI_REG_FLASHCMDCTRL_WR_DATA_EN_MSK               DEF_BIT_15
#define  FS_QSPI_REG_FLASHCMDCTRL_CMD_ADDR_EN_MSK              DEF_BIT_19
#define  FS_QSPI_REG_FLASHCMDCTRL_RD_DATA_BYTES_MSK            DEF_BIT_FIELD(3u, 20u)
#define  FS_QSPI_REG_FLASHCMDCTRL_RD_DATA_EN_MSK               DEF_BIT_23

#define  FS_QSPI_REG_FLASHCMDCTRL_DUMMY_BYTES_OFFSET           7u
#define  FS_QSPI_REG_FLASHCMDCTRL_WR_DATA_BYTES_OFFSET         12u
#define  FS_QSPI_REG_FLASHCMDCTRL_NBR_ADDR_BYTES_OFFSET        16u
#define  FS_QSPI_REG_FLASHCMDCTRL_RD_DATA_BYTES_OFFSET         20u
#define  FS_QSPI_REG_FLASHCMDCTRL_OPCODE_OFFSET                24u

/********************************************************************************************************
 ********************************************************************************************************
 *                                               DATA TYPES
 ********************************************************************************************************
 *******************************************************************************************************/

/********************************************************************************************************
 *                                               REGISTERS
 *
 * Note(s) : (1) Some flash devices does not support XIP (eXecute In Place). However it is still possible
 *               to perform XIP in software. Two types of XIP can be defined:
 *
 *               (a) XIP hardware: Quad SPI XIP mode and direct (memory-mapped) mode activated. NOR flash
 *                   XIP activated.
 *
 *               (b) XIP software: Quad SPI direct mode activated only.
 *******************************************************************************************************/

//                                                                 ---------------- QSPI REGISTERS MAP ----------------
typedef struct qspi_reg {
  CPU_REG32  CONFIG;                                            // QSPI Configuration Register.
  CPU_REG32  DEVINSTRRDCONFIG;                                  // Device Read Instruction Configuration Register.
  CPU_REG32  DEVINSTRWRCONFIG;                                  // Device Write Instruction Configuration Register.
  CPU_REG32  DEVDELAY;                                          // QSPI Device Delay Register.
  CPU_REG32  RDDATACAPTURE;                                     // Read Data Capture Register.
  CPU_REG32  DEVSIZECONFIG;                                     // Device Size Configuration Register.
  CPU_REG32  SRAMPARTITIONCFG;                                  // SRAM Partition Configuration Register.
  CPU_REG32  INDAHBADDRTRIGGER;                                 // Indirect Address Trigger Register.
  CPU_INT32U Reserved0[1u];
  CPU_REG32  REMAPADDR;                                         // Remap Address Register.
  CPU_REG32  MODEBITCONFIG;                                     // Mode Bit Configuration Register.
  CPU_REG32  SRAMFILL;                                          // SRAM Fill Register.
  CPU_REG32  TXTHRESH;                                          // TX Threshold Register.
  CPU_REG32  RXTHRESH;                                          // RX Threshold Register.
  CPU_REG32  WRITECOMPLETIONCTRL;                               // Write Completion Control Register.
  CPU_REG32  NOOFPOLLSBEFEXP;                                   // Polling Expiration Register.
  CPU_REG32  IRQSTATUS;                                         // Interrupt Status Register.
  CPU_REG32  IRQMASK;                                           // Interrupt Mask.
  CPU_INT32U Reserved1[2u];
  CPU_REG32  LOWERWRPROT;                                       // Lower Write Protection Register.
  CPU_REG32  UPPERWRPROT;                                       // Upper Write Protection Register.
  CPU_REG32  WRPROTCTRL;                                        // Write Protection Control Register.
  CPU_INT32U Reserved2[1u];
  CPU_REG32  INDIRECTREADXFERCTRL;                              // Indirect Read Transfer Control Register.
  CPU_REG32  INDIRECTREADXFERWATERMARK;                         // Indirect Read Transfer Watermark Register.
  CPU_REG32  INDIRECTREADXFERSTART;                             // Indirect Read Transfer Start Address Register.
  CPU_REG32  INDIRECTREADXFERNUMBYTES;                          // Indirect Read Transfer Number Bytes Register.
  CPU_REG32  INDIRECTWRITEXFERCTRL;                             // Indirect Write Transfer Control Register.
  CPU_REG32  INDIRECTWRITEXFERWATERMARK;                        // Indirect Write Transfer Watermark Register.
  CPU_REG32  INDIRECTWRITEXFERSTART;                            // Indirect Write Transfer Start Address Register.
  CPU_REG32  INDIRECTWRITEXFERNUMBYTES;                         // Indirect Write Transfer Number Bytes Register.
  CPU_REG32  INDIRECTTRIGGERADDRRANGE;                          // Indirect Trigger Address Range Register.
  CPU_INT32U Reserved3[2u];
  CPU_REG32  FLASHCOMMANDCTRLMEM;                               // Flash Command Control Memory Register.
  CPU_REG32  FLASHCMDCTRL;                                      // Flash Command Control Register.
  CPU_REG32  FLASHCMDADDR;                                      // Flash Command Address Register.
  CPU_INT32U Reserved4[2u];
  CPU_REG32  FLASHRDDATALOWER;                                  // Flash Command Read Data Register (Lower).
  CPU_REG32  FLASHRDDATAUPPER;                                  // Flash Command Read Data Register (Upper).
  CPU_REG32  FLASHWRDATALOWER;                                  // Flash Command Write Data Register (Lower).
  CPU_REG32  FLASHWRDATAUPPER;                                  // Flash Command Write Data Register (Upper).
  CPU_REG32  POLLINGFLASHSTATUS;                                // Polling Flash Status Register.
  CPU_REG32  PHYCONFIGURATION;                                  // PHY Configuration Register.
  CPU_REG32  PHYMASTERCONTROL;                                  // PHY DLL Master Control Register.
  CPU_REG32  DLLOBSERVABLELOWER;                                // DLL Observable Register Lower.
  CPU_REG32  DLLOBSERVABLEUPPER;                                // DLL Observable Register Upper.
  CPU_INT32U Reserved5[7u];
  CPU_REG32  OPCODEEXTLOWER;                                    // Opcode Extension Register (Lower).
  CPU_REG32  OPCODEEXTUPPER;                                    // Opcode Extension Register (Upper).
  CPU_INT32U Reserved6[5u];
  CPU_REG32  MODULEID;                                          // Module ID Register.

  CPU_REG32  CTRL;                                              // Control Register.
  CPU_REG32  ROUTEPEN;                                          // I/O Routing Pin Enable Register.
  CPU_REG32  ROUTELOC0;                                         // I/O Route Location Register 0.
} QSPI_REG;

typedef enum qspi_flash_xfer_type {
  QSPI_XFER_TYPE_NONE = 0u,
  QSPI_XFER_TYPE_STIG_RD = 1u,
  QSPI_XFER_TYPE_STIG_WR = 2u,
  QSPI_XFER_TYPE_INDIRECT_RD = 3u,
  QSPI_XFER_TYPE_INDIRECT_WR = 4u,
  QSPI_XFER_TYPE_DIRECT_RD = 5u,
  QSPI_XFER_TYPE_DIRECT_WR = 6u
} QSPI_FLASH_XFER_TYPE;

