espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/micrium_os/drivers/fs/source/fs_nor_quad_spi_drv_silabs_efm32gg11.c
//                                                                 ------------------- DRIVER DATA --------------------
typedef struct qspi_data {
  FS_NOR_QUAD_SPI_CTRLR_INFO *QuadSPI_CtrlrInfoPtr;             // Pointer to QSPI controller info.
  CPU_BOOLEAN                DTR_En;                            // Flag indicating if Double Transfer Rate enabled.
  CPU_BOOLEAN                PHY_En;                            // Flag indicating if PHY module enabled.
  CPU_BOOLEAN                XIP_SwEn;                          // Flag indicating if XIP SW enabled (See Note #1).
  CPU_BOOLEAN                XIP_HwEn;                          // Flag indicating if XIP HW enabled (See Note #1).
  CPU_INT08U                 ChipSelID;                         // Chip select ID to which flash device is connected.
} QSPI_DATA;

/********************************************************************************************************
 ********************************************************************************************************
 *                                       LOCAL FUNCTION PROTOTYPES
 ********************************************************************************************************
 *******************************************************************************************************/

/********************************************************************************************************
 *                                   DRIVER INTERFACE FUNCTION PROTOTYPES
 *******************************************************************************************************/

static void *FS_NOR_QuadSPI_Add(const FS_NOR_QUAD_SPI_CTRLR_INFO *p_ctrlr_info,
                                const FS_NOR_QUAD_SPI_SLAVE_INFO *p_slave_info,
                                MEM_SEG                          *p_seg,
                                RTOS_ERR                         *p_err);

static void FS_NOR_QuadSPI_Start(void     *p_drv_data,
                                 RTOS_ERR *p_err);

static void FS_NOR_QuadSPI_Stop(void     *p_drv_data,
                                RTOS_ERR *p_err);

static void FS_NOR_QuadSPI_ClkSet(void       *p_drv_data,
                                  CPU_INT32U clk,
                                  RTOS_ERR   *p_err);

static void FS_NOR_QuadSPI_DTR_Set(void        *p_drv_data,
                                   CPU_BOOLEAN en,
                                   RTOS_ERR    *p_err);

static void FS_NOR_QuadSPI_FlashSizeSet(void       *p_drv_data,
                                        CPU_INT08U flash_size_log2,
                                        CPU_INT08U chip_sel,
                                        RTOS_ERR   *p_err);

static void FS_NOR_QuadSPI_CmdSend(void                           *p_drv_data,
                                   const FS_NOR_QUAD_SPI_CMD_DESC *p_cmd,
                                   CPU_INT08U                     addr_tbl[],
                                   CPU_INT08U                     inter_data[],
                                   CPU_INT08U                     inter_cycles,
                                   void                           *p_xfer_data,
                                   CPU_INT32U                     xfer_size,
                                   RTOS_ERR                       *p_err);

static CPU_SIZE_T FS_NOR_QuadSPI_AlignReqGet(void     *p_drv_data,
                                             RTOS_ERR *p_err);

static void FS_NOR_QuadSPI_XipCfg(void        *p_drv_data,
                                  CPU_BOOLEAN xip_en,
                                  CPU_BOOLEAN flash_xip_support,
                                  RTOS_ERR    *p_err);

/********************************************************************************************************
 *                                       LOCAL FUNCTION PROTOTYPES
 *******************************************************************************************************/

static void FS_NOR_QuadSPI_ChipSelect(const QSPI_DATA *p_drv_data,
                                      CPU_INT08U      chip_sel,
                                      RTOS_ERR        *p_err);

static void FS_NOR_QuadSPI_ClkOutSet(const QSPI_DATA *p_drv_data,
                                     CPU_INT32U      ref_clk_hz,
                                     CPU_INT32U      sclk_out_hz,
                                     RTOS_ERR        *p_err);

static void FS_NOR_QuadSPI_StigRd(const QSPI_DATA                *p_drv_data,
                                  const FS_NOR_QUAD_SPI_CMD_DESC *p_cmd,
                                  CPU_INT08U                     inter_cycles,
                                  void                           *p_xfer_data,
                                  CPU_INT32U                     xfer_size,
                                  RTOS_ERR                       *p_err);

static void FS_NOR_QuadSPI_StigWr(const QSPI_DATA                *p_drv_data,
                                  const FS_NOR_QUAD_SPI_CMD_DESC *p_cmd,
                                  CPU_INT08U                     addr_tbl[],
                                  CPU_INT08U                     inter_cycles,
                                  void                           *p_xfer_data,
                                  CPU_INT32U                     xfer_size,
                                  RTOS_ERR                       *p_err);

static void FS_NOR_QuadSPI_StigCmdFlashExec(const QSPI_DATA *p_drv_data,
                                            CPU_INT32U      reg_val,
                                            RTOS_ERR        *p_err);

static void FS_NOR_QuadSPI_IdleCheck(const QSPI_DATA *p_drv_data,
                                     RTOS_ERR        *p_err);

static void FS_NOR_QuadSPI_IndirectRd(const QSPI_DATA                *p_drv_data,
                                      const FS_NOR_QUAD_SPI_CMD_DESC *p_cmd,
                                      CPU_INT08U                     addr_tbl[],
                                      CPU_INT08U                     inter_cycles,
                                      void                           *p_xfer_data,
                                      CPU_INT32U                     xfer_size,
                                      RTOS_ERR                       *p_err);

static void FS_NOR_QuadSPI_IndirectRd_SRAM(const QSPI_DATA *p_drv_data,
                                           void            *p_dest_buf,
                                           const void      *p_src_sram,
                                           CPU_INT32U      xfer_size,
                                           RTOS_ERR        *p_err);

static void FS_NOR_QuadSPI_DirectRd(const QSPI_DATA                *p_drv_data,
                                    const FS_NOR_QUAD_SPI_CMD_DESC *p_cmd,
                                    CPU_INT08U                     addr_tbl[],
                                    void                           *p_xfer_data,
                                    CPU_INT32U                     xfer_size,
                                    RTOS_ERR                       *p_err);

static void FS_NOR_QuadSPI_IndirectWr(const QSPI_DATA                *p_drv_data,
                                      const FS_NOR_QUAD_SPI_CMD_DESC *p_cmd,
                                      CPU_INT08U                     addr_tbl[],
                                      CPU_INT08U                     inter_cycles,
                                      void                           *p_xfer_data,
                                      CPU_INT32U                     xfer_size,
                                      RTOS_ERR                       *p_err);

static void FS_NOR_QuadSPI_IndirectWr_SRAM(const QSPI_DATA *p_drv_data,
                                           const void      *p_dest_sram,
                                           void            *p_src_buf,
                                           CPU_INT32U      xfer_size,
                                           RTOS_ERR        *p_err);

static void FS_NOR_QuadSPI_DirectWr(const QSPI_DATA                *p_drv_data,
                                    const FS_NOR_QUAD_SPI_CMD_DESC *p_cmd,
                                    CPU_INT08U                     addr_tbl[],
                                    void                           *p_xfer_data,
                                    CPU_INT32U                     xfer_size,
                                    RTOS_ERR                       *p_err);

/********************************************************************************************************
 ********************************************************************************************************
 *                                           GLOBAL VARIABLES
 ********************************************************************************************************
 *******************************************************************************************************/

const FS_NOR_QUAD_SPI_DRV_API FS_NOR_QuadSpiDrvAPI_Silabs_EFM32GG11 = {
  .Add = FS_NOR_QuadSPI_Add,
  .Start = FS_NOR_QuadSPI_Start,
  .Stop = FS_NOR_QuadSPI_Stop,
  .ClkSet = FS_NOR_QuadSPI_ClkSet,
  .DTR_Set = FS_NOR_QuadSPI_DTR_Set,
  .FlashSizeSet = FS_NOR_QuadSPI_FlashSizeSet,
  .CmdSend = FS_NOR_QuadSPI_CmdSend,
  .WaitWhileBusy = DEF_NULL,
  .AlignReqGet = FS_NOR_QuadSPI_AlignReqGet,
  .XipBitSet = DEF_NULL,
  .XipCfg = FS_NOR_QuadSPI_XipCfg
};

/********************************************************************************************************
 ********************************************************************************************************
 *                                           LOCAL FUNCTIONS
 ********************************************************************************************************
 *******************************************************************************************************/

/****************************************************************************************************//**
 *                                           FS_NOR_QuadSPI_Add()
 *
 * @brief    Add a Quad SPI controller driver instance.
 *
 * @param    p_ctrlr_info    Pointer to a controller information structure.
 *
 * @param    p_slave_info    Pointer to a slave information structure.
 *
 * @param    p_seg           Pointer to a memory segment where to allocate the controller driver instance.
 *
 * @param    p_err           Error pointer.
 *
 * @return   Pointer to driver-specific data, if NO error(s).
 *           Null pointer,                    otherwise.
 *******************************************************************************************************/
static void *FS_NOR_QuadSPI_Add(const FS_NOR_QUAD_SPI_CTRLR_INFO *p_ctrlr_info,
                                const FS_NOR_QUAD_SPI_SLAVE_INFO *p_slave_info,
                                MEM_SEG                          *p_seg,
                                RTOS_ERR                         *p_err)
{
  QSPI_DATA   *p_quad_spi_drv_data = DEF_NULL;
  QSPI_REG    *p_reg = (QSPI_REG *)p_ctrlr_info->BaseAddr;
  CPU_INT32U  reg_val;
  CPU_INT32U  clk_pol;
  CPU_INT32U  clk_phase;
  CPU_BOOLEAN ok = DEF_FAIL;

  //                                                               Alloc drv private data.
  p_quad_spi_drv_data = (QSPI_DATA *)Mem_SegAlloc(DEF_NULL,
                                                  p_seg,
                                                  sizeof(QSPI_DATA),
                                                  p_err);
  if (RTOS_ERR_CODE_GET(*p_err) != RTOS_ERR_NONE) {
    RTOS_ERR_CONTEXT_REFRESH(*p_err);
    return (DEF_NULL);
  }
  Mem_Clr(p_quad_spi_drv_data, sizeof(QSPI_DATA));

