espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/micrium_os/drivers/fs/source/fs_nor_quad_spi_drv_silabs_efm32gg11.c
  //                                                               Save QSPI controller info for later usage by drv.
  p_quad_spi_drv_data->QuadSPI_CtrlrInfoPtr = (FS_NOR_QUAD_SPI_CTRLR_INFO *)p_ctrlr_info;

  //                                                               --------------------- BSP INIT ---------------------
  if (p_ctrlr_info->BspApiPtr->Init != DEF_NULL) {
    ok = p_ctrlr_info->BspApiPtr->Init(DEF_NULL,                // DEF_NULL = no intr used by this QSPI drv.
                                       p_quad_spi_drv_data);
    if (ok != DEF_OK) {
      RTOS_ERR_SET(*p_err, RTOS_ERR_IO);
      return (DEF_NULL);
    }
  }
  //                                                               Cfg clock(s) required by QSPI ctrlr.
  if (p_ctrlr_info->BspApiPtr->ClkCfg != DEF_NULL) {
    ok = p_ctrlr_info->BspApiPtr->ClkCfg();
    if (ok != DEF_OK) {
      RTOS_ERR_SET(*p_err, RTOS_ERR_IO);
      return (DEF_NULL);
    }
  }
  //                                                               Cfg I/O needed by QSPI ctrlr if necessary.
  if (p_ctrlr_info->BspApiPtr->IO_Cfg != DEF_NULL) {
    ok = p_ctrlr_info->BspApiPtr->IO_Cfg();
    if (ok != DEF_OK) {
      RTOS_ERR_SET(*p_err, RTOS_ERR_IO);
      return (DEF_NULL);
    }
  }
  //                                                               Cfg interrupt controller if necessary.
  if (p_ctrlr_info->BspApiPtr->IntCfg != DEF_NULL) {
    ok = p_ctrlr_info->BspApiPtr->IntCfg();
    if (ok != DEF_OK) {
      RTOS_ERR_SET(*p_err, RTOS_ERR_IO);
      return (DEF_NULL);
    }
  }

  //                                                               -------------------- QSPI INIT ---------------------
  FS_NOR_QuadSPI_IdleCheck(p_quad_spi_drv_data, p_err);         // Poll QSPI idle status to ensure QSPI has finished.

  DEF_BIT_CLR(p_reg->CONFIG, FS_QSPI_REG_CONFIG_EN_MSK);        // Dis controller to ensure proper init.

  //                                                               Instruction transferred on DQ0 (1 bit).
  reg_val = p_reg->DEVINSTRRDCONFIG;
  DEF_BIT_FIELD_WR(reg_val, FS_QSPI_XFER_MODE_SINGLE_IO, FS_QSPI_REG_DEVINSTRRDCONFIG_INST_WIDTH_MSK);
  p_reg->DEVINSTRRDCONFIG = reg_val;

  //                                                               Cfg reg CONFIG.
  reg_val = p_reg->CONFIG;
  //                                                               Set polarity and phase.
  switch (p_slave_info->Mode) {
    case FS_NOR_SPI_MODE_0:
      clk_phase = 0u;
      clk_pol = 0u;
      break;

    case FS_NOR_SPI_MODE_3:
      clk_phase = 1u;
      clk_pol = 1u;
      break;

    case FS_NOR_SPI_MODE_1:
    case FS_NOR_SPI_MODE_2:
    default:
      RTOS_ERR_SET(*p_err, RTOS_ERR_INIT);
      return (DEF_NULL);
  }

  DEF_BIT_FIELD_WR(reg_val, clk_phase, FS_QSPI_REG_CONFIG_SEL_CLK_PHASE_MSK);
  DEF_BIT_FIELD_WR(reg_val, clk_pol, FS_QSPI_REG_CONFIG_SEL_CLK_POL_MSK);

  DEF_BIT_CLR(reg_val, FS_QSPI_REG_CONFIG_DAC_EN_MSK);          // Dis Direct Access Controller.
                                                                // Dis PHY module.
  DEF_BIT_CLR(p_reg->CONFIG, FS_QSPI_REG_CONFIG_PHY_MODE_EN_MSK);
  p_quad_spi_drv_data->PHY_En = DEF_NO;

  p_reg->CONFIG = reg_val;

  //                                                               Cfg Dev Size Cfg reg with some flash info.
  reg_val = p_reg->DEVSIZECONFIG;
  DEF_BIT_FIELD_WR(reg_val, p_slave_info->PageSize, FS_QSPI_REG_DEVSIZECONFIG_PAGE_SIZE_MASK);
  DEF_BIT_FIELD_WR(reg_val, p_slave_info->BlkSizeLog2, FS_QSPI_REG_DEVSIZECONFIG_SUBSECTOR_SIZE_MASK);
  p_reg->DEVSIZECONFIG = reg_val;

  p_reg->REMAPADDR = 0;                                         // No remap. Remap Addr reg only used in direct mode.
  p_reg->IRQMASK = 0;                                           // Disable all interrupts.

  //                                                               Select the NOR flash device.
  FS_NOR_QuadSPI_ChipSelect(p_quad_spi_drv_data,
                            p_slave_info->ChipSelID,
                            p_err);
  if (RTOS_ERR_CODE_GET(*p_err) != RTOS_ERR_NONE) {
    return (DEF_NULL);
  }
  p_quad_spi_drv_data->ChipSelID = p_slave_info->ChipSelID;

  return ((void *)p_quad_spi_drv_data);
}

/****************************************************************************************************//**
 *                                           FS_NOR_QuadSPI_ClkSet()
 *
 * @brief    Set serial clock frequency outputted by the Quad SPI controller to the flash device.
 *
 * @param    p_drv_data  Pointer to driver-specific data.
 *
 * @param    clk         Serial clock frequency.
 *
 * @param    p_err       Error pointer.
 *******************************************************************************************************/
static void FS_NOR_QuadSPI_ClkSet(void       *p_drv_data,
                                  CPU_INT32U clk,
                                  RTOS_ERR   *p_err)
{
  QSPI_DATA  *p_quad_spi_drv_data = (QSPI_DATA *)p_drv_data;
  CPU_INT32U ref_clk_hz;

  //                                                               Get input clock of QSPI controller.
  ref_clk_hz = p_quad_spi_drv_data->QuadSPI_CtrlrInfoPtr->BspApiPtr->ClkFreqGet();

  //                                                               Cfg the serial output clk.
  FS_NOR_QuadSPI_ClkOutSet(p_quad_spi_drv_data,
                           ref_clk_hz,
                           clk,                                 // Desired clk freq to output to NOR flash dev.
                           p_err);
}

/****************************************************************************************************//**
 *                                           FS_NOR_QuadSPI_DTR_Set()
 *
 * @brief    Set double transfer rate (see Note #1).
 *
 * @param    p_drv_data  Pointer to driver-specific data.
 *
 * @param    en          Boolean indicating whether to enable or disable double transfer rate.
 *                       DEF_YES     Enable double transfer rate.
 *                       DEF_NO      Disable double transfer rate.
 *
 * @param    p_err       Error pointer.
 *
 * @note     (1) Double transfer rate is only supported by some READ commands. It does not apply to
 *               PROGRAM command, that is write path.
 *
 * @note     (2) In the QSPI controller, the DTR support is indicated in the field DDREN of register
 *               'Device Read Instruction Configuration'. The DTR will be setup in the function
 *               CmdSend() when sending a READ command that supports DTR.
 *******************************************************************************************************/
static void FS_NOR_QuadSPI_DTR_Set(void        *p_drv_data,
                                   CPU_BOOLEAN en,
                                   RTOS_ERR    *p_err)
{
  QSPI_DATA *p_quad_spi_drv_data = (QSPI_DATA *)p_drv_data;

