espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/micrium_os/drivers/fs/source/fs_nor_quad_spi_drv_silabs_efm32gg11.c
  PP_UNUSED_PARAM(p_err);
  p_quad_spi_drv_data->DTR_En = en;                             // Save DTR support of NOR flash chip (see Note #2).
}

/****************************************************************************************************//**
 *                                       FS_NOR_QuadSPI_FlashSizeSet()
 *
 * @brief    Set flash memory size.
 *
 * @param    p_drv_data          Pointer to driver-specific data.
 *
 * @param    flash_size_log2     Base-2 logarithm of the flash memory size.
 *
 * @param    chip_sel            Chip select ID associated to flash device.
 *
 * @param    p_err               Error pointer.
 *******************************************************************************************************/
static void FS_NOR_QuadSPI_FlashSizeSet(void       *p_drv_data,
                                        CPU_INT08U flash_size_log2,
                                        CPU_INT08U chip_sel,
                                        RTOS_ERR   *p_err)
{
  QSPI_DATA  *p_quad_spi_drv_data = (QSPI_DATA *)p_drv_data;
  QSPI_REG   *p_reg = (QSPI_REG *)p_quad_spi_drv_data->QuadSPI_CtrlrInfoPtr->BaseAddr;
  CPU_INT08U mem_size_val;
  CPU_INT32U cs_mask;

  PP_UNUSED_PARAM(p_err);

  if (chip_sel >= 2u) {                                         // Only 2 chip selects supported by QSPI controller.
    RTOS_ERR_SET(*p_err, RTOS_ERR_INIT);
    return;
  }

  if (flash_size_log2 <= FS_NOR_PHY_SIZE_LOG2_512Mb) {          // Size below 512Mb configured to 512Mb val.
    mem_size_val = FS_QSPI_REG_DEVSIZECONFIG_MEM_SIZE_CS_512Mb;
  } else if (flash_size_log2 >= FS_NOR_PHY_SIZE_LOG2_2Gb) {     // Size above 4Gb configured to 4Gb val.
    mem_size_val = FS_QSPI_REG_DEVSIZECONFIG_MEM_SIZE_CS_4Gb;
  } else {
    mem_size_val = flash_size_log2 - 26u;                       // -26 allows to configure to 1/2Gb reg val.
  }

  if (chip_sel == 0u) {
    cs_mask = FS_QSPI_REG_DEVSIZECONFIG_MEM_SIZE_CS0_MASK;
  } else {
    cs_mask = FS_QSPI_REG_DEVSIZECONFIG_MEM_SIZE_CS1_MASK;
  }
  DEF_BIT_FIELD_WR(p_reg->DEVSIZECONFIG, mem_size_val, cs_mask);
}

/****************************************************************************************************//**
 *                                           FS_NOR_QuadSPI_Start()
 *
 * @brief    Start controller operation.
 *
 * @param    p_drv_data  Pointer to driver-specific data.
 *
 * @param    p_err       Error pointer.
 *******************************************************************************************************/
static void FS_NOR_QuadSPI_Start(void     *p_drv_data,
                                 RTOS_ERR *p_err)
{
  QSPI_DATA *p_quad_spi_drv_data = (QSPI_DATA *)p_drv_data;
  QSPI_REG  *p_reg = (QSPI_REG *)p_quad_spi_drv_data->QuadSPI_CtrlrInfoPtr->BaseAddr;

  PP_UNUSED_PARAM(p_err);
  DEF_BIT_SET(p_reg->CONFIG, FS_QSPI_REG_CONFIG_EN_MSK);        // En controller operations.

  KAL_Dly(FS_QSPI_EN_DELAY_MIN_mS);                             // Wait before issuing 1st cmd after QSPI ctrlr start.
}

/****************************************************************************************************//**
 *                                           FS_NOR_QuadSPI_Stop()
 *
 * @brief    Stop controller operation.
 *
 * @param    p_drv_data  Pointer to driver-specific data.
 *
 * @param    p_err       Error pointer.
 *******************************************************************************************************/
static void FS_NOR_QuadSPI_Stop(void     *p_drv_data,
                                RTOS_ERR *p_err)
{
  QSPI_DATA *p_quad_spi_drv_data = (QSPI_DATA *)p_drv_data;
  QSPI_REG  *p_reg = (QSPI_REG *)p_quad_spi_drv_data->QuadSPI_CtrlrInfoPtr->BaseAddr;

  PP_UNUSED_PARAM(p_err);
  DEF_BIT_CLR(p_reg->CONFIG, FS_QSPI_REG_CONFIG_EN_MSK);        // Dis controller operations.
}

/****************************************************************************************************//**
 *                                           FS_NOR_QuadSPI_CmdSend()
 *
 * @brief    Send a command.
 *
 * @param    p_drv_data      Pointer to driver-specific data.
 *
 * @param    p_cmd           Pointer to a command descriptor.
 *
 * @param    addr_tbl        Source / Destination address table.
 *
 * @param    inter_data      Inter data table.
 *
 * @param    inter_cycles    Inter cycle cnt.
 *
 * @param    p_xfer_data     Pointer to a buffer that contains data to be written or that receives
 *                           data to be read.
 *
 * @param    xfer_size       Number of octets to be read / written.
 *
 * @param    p_err           Error pointer.
 *
 * @note     (1) This QSPI Peripheral supports 'Dummy Cycle' qty rather than transferring 'Dummy Bytes'
 *               thus, the use of the 'Dummy Cycles' (inter_cycles) is used rather than having to
 *               calculate 'Dummy Bytes' (inter_byte_cnt) to send.
 *
 * @note     (2) The NOR command can have one of the following formats:
 *               - (a) OPCODE (single operation such as reset, write enable)
 *               - (b) OPCODE + DATA (flash register read/write access)
 *               - (c) OPCODE + ADDRESS (erase operation)
 *               - (d) OPCODE + ADDRESS + DATA (memory read/write access in indirect/direct mode)
 *
 * @note     (3) The Software Triggered Instruction Generator (STIG) is used to access the volatile
 *               and non-volatile configuration registers, the legacy SPI status register, and other
 *               status and protection registers on the NOR memory.
 *               - (a) It is recommended to use the STIG to perform erase operations.
 *
 * @note     (4) In indirect/direct mode, commands are ONLY for transferring data from/to flash
 *               memory.
 *
 * @note     (5) When XIP hardware activated, that is XIP mode enabled in QSPI and flash device,
 *               flash read/write transfers are not allowed via the Quad SPI driver. It is still
 *               possible to perform commands using the Software Triggered Instruction Generator
 *               (STIG) which accesses flash registers.
 *******************************************************************************************************/
static void FS_NOR_QuadSPI_CmdSend(void                           *p_drv_data,
                                   const FS_NOR_QUAD_SPI_CMD_DESC *p_cmd,
                                   CPU_INT08U                     addr_tbl[],
                                   CPU_INT08U                     inter_data[],
                                   CPU_INT08U                     inter_cycles,
                                   void                           *p_xfer_data,
                                   CPU_INT32U                     xfer_size,
                                   RTOS_ERR                       *p_err)
{
  QSPI_DATA                  *p_quad_spi_drv_data = (QSPI_DATA *)p_drv_data;
  FS_NOR_QUAD_SPI_CTRLR_INFO *p_ctrlr_info = p_quad_spi_drv_data->QuadSPI_CtrlrInfoPtr;
  QSPI_FLASH_XFER_TYPE       xfer_type = QSPI_XFER_TYPE_NONE;

  PP_UNUSED_PARAM(inter_data);

  //                                                               Determine transfer type (see Note #2).
  if (p_cmd->Form.HasOpcode) {                                  // If op code, STIG or indirect mode used.
    if ((!p_cmd->Form.HasAddr)                                  // Flash register operations do NOT use addr.
        || ((p_cmd->Form.HasAddr) && (!xfer_size))) {           // Erase cmd does NOT have data (see Note #3a).
                                                                // Command executed by STIG function (see Note #3).
      if (p_cmd->Form.IsWr) {
        xfer_type = QSPI_XFER_TYPE_STIG_WR;
      } else if (xfer_size == 0u) {
        xfer_type = QSPI_XFER_TYPE_STIG_WR;                     // Commands with only opcode (considered as STIG write).
      } else {
        xfer_type = QSPI_XFER_TYPE_STIG_RD;
      }
    } else {                                                    // Cmd executed in indirect/direct mode (see Note #4).
      if (p_quad_spi_drv_data->XIP_HwEn) {                      // If XIP HW activated, no flash xfer allowed via drv...
        RTOS_ERR_SET(*p_err, RTOS_ERR_IO);                      // ...See Note #5.
        return;
      }

      if (!p_quad_spi_drv_data->XIP_SwEn) {
        if (p_cmd->Form.IsWr) {
          xfer_type = QSPI_XFER_TYPE_INDIRECT_WR;
        } else {
          xfer_type = QSPI_XFER_TYPE_INDIRECT_RD;
        }
      } else {                                                  // If XIP SW activated, direct mode is used.
        if (p_cmd->Form.IsWr) {
          xfer_type = QSPI_XFER_TYPE_DIRECT_WR;
        } else {
          xfer_type = QSPI_XFER_TYPE_DIRECT_RD;
        }
      }
    }
  }

  if (p_ctrlr_info->BspApiPtr->ChipSelEn != DEF_NULL) {
    p_ctrlr_info->BspApiPtr->ChipSelEn(p_quad_spi_drv_data->ChipSelID);
  }

