espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/micrium_os/drivers/fs/source/fs_nor_quad_spi_drv_silabs_efm32gg11.c
  switch (xfer_type) {
    case QSPI_XFER_TYPE_STIG_RD:
      FS_NOR_QuadSPI_StigRd(p_quad_spi_drv_data,
                            p_cmd,
                            inter_cycles,
                            p_xfer_data,
                            xfer_size,
                            p_err);
      break;

    case QSPI_XFER_TYPE_STIG_WR:
      FS_NOR_QuadSPI_StigWr(p_quad_spi_drv_data,
                            p_cmd,
                            addr_tbl,
                            inter_cycles,
                            p_xfer_data,
                            xfer_size,
                            p_err);
      break;

    case QSPI_XFER_TYPE_INDIRECT_RD:
      FS_NOR_QuadSPI_IndirectRd(p_quad_spi_drv_data,
                                p_cmd,
                                addr_tbl,
                                inter_cycles,
                                p_xfer_data,
                                xfer_size,
                                p_err);
      break;

    case QSPI_XFER_TYPE_INDIRECT_WR:
      FS_NOR_QuadSPI_IndirectWr(p_quad_spi_drv_data,
                                p_cmd,
                                addr_tbl,
                                inter_cycles,
                                p_xfer_data,
                                xfer_size,
                                p_err);
      break;

    case QSPI_XFER_TYPE_DIRECT_RD:
      FS_NOR_QuadSPI_DirectRd(p_quad_spi_drv_data,
                              p_cmd,
                              addr_tbl,
                              p_xfer_data,
                              xfer_size,
                              p_err);
      break;

    case QSPI_XFER_TYPE_DIRECT_WR:
      FS_NOR_QuadSPI_DirectWr(p_quad_spi_drv_data,
                              p_cmd,
                              addr_tbl,
                              p_xfer_data,
                              xfer_size,
                              p_err);
      break;

    default:
      RTOS_ERR_SET(*p_err, RTOS_ERR_IO);
      break;
  }

  if (p_ctrlr_info->BspApiPtr->ChipSelDis != DEF_NULL) {
    p_ctrlr_info->BspApiPtr->ChipSelDis(p_quad_spi_drv_data->ChipSelID);
  }
}

/****************************************************************************************************//**
 *                                       FS_NOR_QuadSPI_AlignReqGet()
 *
 * @brief    Get buffer alignment requirement of the controller.
 *
 * @param    p_drv_data  Pointer to driver-specific data.
 *
 * @param    p_err       Error pointer.
 *
 * @return   buffer alignment requirement in octets.
 *******************************************************************************************************/
static CPU_SIZE_T FS_NOR_QuadSPI_AlignReqGet(void     *p_drv_data,
                                             RTOS_ERR *p_err)
{
  QSPI_DATA *p_quad_spi_drv_data = (QSPI_DATA *)p_drv_data;

  PP_UNUSED_PARAM(p_err);

  return (p_quad_spi_drv_data->QuadSPI_CtrlrInfoPtr->AlignReq);
}

/****************************************************************************************************//**
 *                                           FS_NOR_QuadSPI_XipCfg()
 *
 * @brief    Configure Quad SPI controller in XIP (eXecute-In-Place) mode.
 *
 * @param    p_drv_data          Pointer to driver-specific data.
 *
 * @param    xip_en              XIP mode enable/disable flag.
 *
 * @param    flash_xip_support   Flag indicating if flash device supports XIP (see Note #1).
 *
 * @param    p_err               Error pointer.
 *
 * @note     (1) XIP is supported by some flash devices. When a flash device does not support XIP,
 *               it is still possible to implement XIP from a software perspective. Two types of XIP
 *               can be defined:
 *               - (a) XIP hardware: a dedicated XIP mode can be activated in the NOR flash and in the
 *                     Quad SPI controller. This XIP is considered the full XIP.
 *               - (b) XIP software: the NOR flash does not support XIP and the Quad SPI controller XIP
 *                     cannot be activated in that case. Still it is possible to perform a XIP software
 *                     by enabling the Quad SPI controller in memory-mapped (i.e. direct) mode. It is
 *                     less effective than the full XIP because the command instruction phase cannot be
 *                     omitted.
 *******************************************************************************************************/
static void FS_NOR_QuadSPI_XipCfg(void        *p_drv_data,
                                  CPU_BOOLEAN xip_en,
                                  CPU_BOOLEAN flash_xip_support,
                                  RTOS_ERR    *p_err)
{
  QSPI_DATA  *p_quad_spi_drv_data = (QSPI_DATA *)p_drv_data;
  QSPI_REG   *p_reg = (QSPI_REG *)p_quad_spi_drv_data->QuadSPI_CtrlrInfoPtr->BaseAddr;
  CPU_INT32U reg_val = 0u;

  PP_UNUSED_PARAM(p_err);

  DEF_BIT_CLR(p_reg->CONFIG, FS_QSPI_REG_CONFIG_EN_MSK);        // Dis controller to ensure proper XIP cfg.

  //                                                               -------------------- XIP EN CFG --------------------
  reg_val = p_reg->CONFIG;
  if (xip_en) {
    DEF_BIT_SET(reg_val, FS_QSPI_REG_CONFIG_DAC_EN_MSK);        // En direct access mode.

    if (flash_xip_support) {                                    // See Note #1.
      p_reg->MODEBITCONFIG = DEF_BIT_NONE;                      // Set value of XIP confirmation bit.
                                                                // En mode bit (i.e. XIP confirmation bit).
      DEF_BIT_SET(p_reg->DEVINSTRRDCONFIG, FS_QSPI_REG_DEVINSTRRDCONFIG_MODE_BITS_EN_MSK);
      //                                                           Enter XIP Mode immediately.
      DEF_BIT_SET(reg_val, FS_QSPI_REG_CONFIG_ENTER_XIP_IMM_MSK);

      p_quad_spi_drv_data->XIP_HwEn = DEF_YES;
    } else {
      p_quad_spi_drv_data->XIP_SwEn = DEF_YES;
    }

    //                                                             -------------------- XIP DIS CFG -------------------
  } else {
    DEF_BIT_CLR(reg_val, FS_QSPI_REG_CONFIG_DAC_EN_MSK);        // Dis direct access mode.

