espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/micrium_os/drivers/fs/source/fs_nor_quad_spi_drv_silabs_efm32gg11.c
    if (flash_xip_support) {
      p_reg->MODEBITCONFIG = DEF_BIT_NONE;                      // Reset mode bit.
                                                                // Dis mode bit (i.e. XIP confirmation bit).
      DEF_BIT_CLR(p_reg->DEVINSTRRDCONFIG, FS_QSPI_REG_DEVINSTRRDCONFIG_MODE_BITS_EN_MSK);
      //                                                           Dis XIP Mode immediately.
      DEF_BIT_CLR(reg_val, FS_QSPI_REG_CONFIG_ENTER_XIP_IMM_MSK);
      //                                                           Dis AHB remapping in case it was used.
      DEF_BIT_CLR(reg_val, FS_QSPI_REG_CONFIG_AHB_REMAP_EN_MSK);

      p_quad_spi_drv_data->XIP_HwEn = DEF_NO;
    } else {
      p_quad_spi_drv_data->XIP_SwEn = DEF_NO;
    }
  }
  p_reg->CONFIG = reg_val;

  DEF_BIT_SET(p_reg->CONFIG, FS_QSPI_REG_CONFIG_EN_MSK);        // En controller operations.

  KAL_Dly(FS_QSPI_EN_DELAY_MIN_mS);                             // Wait before issuing 1st cmd after QSPI ctrlr start.
}

/********************************************************************************************************
 ********************************************************************************************************
 *                                       LOCAL FUNCTION PROTOTYPES
 ********************************************************************************************************
 *******************************************************************************************************/

/****************************************************************************************************//**
 *                                           FS_NOR_QSPI_ChipSelect()
 *
 * @brief    Configure the chip select.
 *
 * @param    p_drv_data      Pointer to driver-specific data.
 *
 * @param    chip_select     chip select ID associated to the flash device.
 *
 * @param    p_err           Error pointer.
 *******************************************************************************************************/
static void FS_NOR_QuadSPI_ChipSelect(const QSPI_DATA *p_drv_data,
                                      CPU_INT08U      chip_sel,
                                      RTOS_ERR        *p_err)
{
  QSPI_REG   *p_reg = (QSPI_REG *)p_drv_data->QuadSPI_CtrlrInfoPtr->BaseAddr;
  CPU_INT32U reg_val;

  if (chip_sel >= 2u) {                                         // Only 2 chip selects supported by QSPI controller.
    RTOS_ERR_SET(*p_err, RTOS_ERR_INIT);
    return;
  }
  //                                                               Select the active NOR flash device.
  reg_val = p_reg->CONFIG;
  DEF_BIT_CLR(reg_val, FS_QSPI_REG_CONFIG_PERSELDEC_MSK);       // Only one chip select active.
                                                                // Set the active chip select. Active low.
  DEF_BIT_FIELD_WR(reg_val, chip_sel, FS_QSPI_REG_CONFIG_PERCSLINES_MSK);
  p_reg->CONFIG = reg_val;
}

/****************************************************************************************************//**
 *                                       FS_NOR_QuadSPI_ClkOutSet()
 *
 * @brief    Configure the clock source for the connected flash device.
 *
 * @param    p_drv_data      Pointer to driver-specific data.
 *
 * @param    ref_clk_hz      Input clock frequency used to generate serial clock to flash device.
 *
 * @param    sclk_out_hz     Desired serial clock frequency for the flash device.
 *
 * @param    p_err           Error pointer.
 *******************************************************************************************************/
static void FS_NOR_QuadSPI_ClkOutSet(const QSPI_DATA *p_drv_data,
                                     CPU_INT32U      ref_clk_hz,
                                     CPU_INT32U      sclk_out_hz,
                                     RTOS_ERR        *p_err)
{
  QSPI_REG   *p_reg = (QSPI_REG *)p_drv_data->QuadSPI_CtrlrInfoPtr->BaseAddr;
  CPU_INT32U reg_val;
  CPU_INT32U field_val;
  CPU_INT32U div;

  //                                                               Clear MSTRBAUDDIV field.
  reg_val = p_reg->CONFIG;
  DEF_BIT_CLR(reg_val, FS_QSPI_REG_CONFIG_BAUDDIV_MSK);
  //                                                               Compute baud rate divisor to generate sclk_out.
  div = ref_clk_hz / sclk_out_hz;

  //                                                               Check that baud rate divisor is valid.
  if ((div < FS_QSPI_REG_CONFIG_BAUDDIV_MIN)
      || (div > FS_QSPI_REG_CONFIG_BAUDDIV_MAX)) {
    RTOS_ERR_SET(*p_err, RTOS_ERR_INIT);                        // Divisor must be between specific boundaries.
    return;
  }
  if (!p_drv_data->PHY_En) {                                    // If PHY dis, divisor must meet some requirements.
    if (!p_drv_data->DTR_En) {
      if (div < FS_QSPI_REG_CONFIG_BAUDDIV_SDR_MIN) {
        RTOS_ERR_SET(*p_err, RTOS_ERR_INIT);                    // Divisor must be at least 4 for SDR.
        return;
      }
    } else {
      if (div < FS_QSPI_REG_CONFIG_BAUDDIV_DDR_MIN) {
        RTOS_ERR_SET(*p_err, RTOS_ERR_INIT);                    // Divisor must be at least 8 for DDR.
        return;
      }
    }
  }
  //                                                               Fit 'div' value on a 4-bit field value.
  if ((div & 1)) {                                              // Odd value.
    field_val = (div / 2);
  } else {                                                      // Even value.
    field_val = (div / 2) - 1;
  }

  LOG_VRB(("qspi_clk = ", (u)ref_clk_hz, "Hz, sclk_out(cfg'ed) = ", (u)sclk_out_hz, "Hz, Div ", (u)div, ", sclk_out(real) = ", (u)(ref_clk_hz / ((field_val + 1) * 2)), "Hz."));

  DEF_BIT_FIELD_WR(reg_val, field_val, FS_QSPI_REG_CONFIG_BAUDDIV_MSK);
  p_reg->CONFIG = reg_val;
}

/****************************************************************************************************//**
 *                                           FS_NOR_QuadSPI_StigRd()
 *
 * @brief    Perform a NOR read command by using the Software Triggered Instruction Generator (STIG).
 *
 * @param    p_drv_data      Pointer to driver-specific data.
 *
 * @param    p_cmd           Pointer to command descriptor for command to send.
 *
 * @param    inter_cycles    Number of intermediate data CYCLES to insert between address and data
 *                           phases.
 *
 * @param    p_xfer_data     Pointer to transfer buffer.
 *
 * @param    xfer_size       Size of transfer, in octets.
 *
 * @param    p_err           Error pointer.
 *
 * @note     (1) This function manages the following type of read commands:
 *               - (a) Flash device register read: command = instruction opcode + data
 *                     Read commands always involve data transfer from flash device to MCU. Single
 *                     operations such as reset, erase, write enable are considered as write command which
 *                     as only an instruction opcode or instruction opcode and address.
 *******************************************************************************************************/
static void FS_NOR_QuadSPI_StigRd(const QSPI_DATA                *p_drv_data,
                                  const FS_NOR_QUAD_SPI_CMD_DESC *p_cmd,
                                  CPU_INT08U                     inter_cycles,
                                  void                           *p_xfer_data,
                                  CPU_INT32U                     xfer_size,
                                  RTOS_ERR                       *p_err)
{
  QSPI_REG   *p_reg = (QSPI_REG *)p_drv_data->QuadSPI_CtrlrInfoPtr->BaseAddr;
  CPU_INT08U *p_rx_buf08 = (CPU_INT08U *)p_xfer_data;
  CPU_INT32U reg_val;
  CPU_INT32U read_len;
  CPU_INT08U dummy_bytes;

  //                                                               Argument checking.
  if ((!xfer_size)
      || (p_xfer_data == DEF_NULL)) {                           // Rd cmds have always data to read.
    LOG_ERR(("Invalid input arguments xfer_size ", (u)xfer_size, "p_xfer_data 0x", (x)((CPU_INT32U)p_xfer_data)));
    RTOS_ERR_SET(*p_err, RTOS_ERR_IO);
    return;
  }

  if (xfer_size > FS_QSPI_STIG_DATA_LEN_MAX) {
    LOG_ERR(("READ cmd with data payload > 8 bytes NOT implemented yet, xfer_size ", (u)xfer_size, "p_xfer_data 0x", (x)((CPU_INT32U)p_xfer_data)));
    RTOS_ERR_SET(*p_err, RTOS_ERR_IO);
    return;
  }
  //                                                               ------------------ COMMAND SETUP -------------------
  reg_val = p_cmd->Opcode << FS_QSPI_REG_FLASHCMDCTRL_OPCODE_OFFSET;
  DEF_BIT_SET(reg_val, FS_QSPI_REG_FLASHCMDCTRL_RD_DATA_EN_MSK);
  //                                                               Read data size is 0-based. 0 means 1 byte and so on.
  reg_val |= (((xfer_size - 1) << FS_QSPI_REG_FLASHCMDCTRL_RD_DATA_BYTES_OFFSET) & FS_QSPI_REG_FLASHCMDCTRL_RD_DATA_BYTES_MSK);
  //                                                               Set dummy bytes.
  dummy_bytes = inter_cycles / FS_QSPI_DUMMY_CYCLES_PER_BYTE;
  if ((inter_cycles % FS_QSPI_DUMMY_CYCLES_PER_BYTE) != 0) {
    dummy_bytes += 1u;
  }
  reg_val |= (dummy_bytes << FS_QSPI_REG_FLASHCMDCTRL_DUMMY_BYTES_OFFSET) & FS_QSPI_REG_FLASHCMDCTRL_DUMMY_BYTES_MSK;

