espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/micrium_os/drivers/fs/source/fs_nor_quad_spi_drv_silabs_efm32gg11.c
  //                                                               ---------------- COMMAND EXECUTION -----------------
  FS_NOR_QuadSPI_StigCmdFlashExec(p_drv_data,
                                  reg_val,
                                  p_err);
  if (RTOS_ERR_CODE_GET(*p_err) != RTOS_ERR_NONE) {
    return;
  }
  //                                                               -------------------- DATA READ ---------------------
  reg_val = p_reg->FLASHRDDATALOWER;                            // Read lower 4 bytes.
  read_len = (xfer_size > 4) ? 4 : xfer_size;
  Mem_Copy(p_rx_buf08,                                          // Place read bytes in correct order.
           &reg_val,
           read_len);

  if (xfer_size > 4) {                                          // Read upper 4 bytes if needed.
    p_rx_buf08 += xfer_size;
    reg_val = p_reg->FLASHRDDATAUPPER;

    read_len = xfer_size - read_len;
    Mem_Copy(p_rx_buf08,
             &reg_val,
             read_len);
  }
}

/****************************************************************************************************//**
 *                                           FS_NOR_QuadSPI_StigWr()
 *
 * @brief    Perform a NOR write command by using the Software Triggered Instruction Generator (STIG).
 *
 * @param    p_drv_data      Pointer to driver-specific data.
 *
 * @param    p_cmd           Pointer to command descriptor for command to send.
 *
 * @param    addr_tbl        Array of address octets, in MSB order.
 *
 * @param    inter_cycles    Number of intermediate data CYCLES to insert between address and data
 *                           phases.
 *
 * @param    p_xfer_data     Pointer to transfer buffer.
 *
 * @param    xfer_size       Size of transfer, in octets.
 *
 * @param    p_err           Error pointer.
 *
 * @note     (1) This function manages the following type of write commands:
 *               - (a) Flash device register write:                  command = instruction opcode + data
 *               - (b) Single operation such as reset, write enable: command = instruction opcode
 *               - (c) Single operation such as erase:               command = instruction opcode + address
 *******************************************************************************************************/
static void FS_NOR_QuadSPI_StigWr(const QSPI_DATA                *p_drv_data,
                                  const FS_NOR_QUAD_SPI_CMD_DESC *p_cmd,
                                  CPU_INT08U                     addr_tbl[],
                                  CPU_INT08U                     inter_cycles,
                                  void                           *p_xfer_data,
                                  CPU_INT32U                     xfer_size,
                                  RTOS_ERR                       *p_err)
{
  QSPI_REG   *p_reg = (QSPI_REG *)p_drv_data->QuadSPI_CtrlrInfoPtr->BaseAddr;
  CPU_INT08U *p_tx_buf08 = (CPU_INT08U *)p_xfer_data;
  CPU_INT32U reg_val = 0u;
  CPU_INT32U flash_addr = 0u;
  CPU_INT08U addr_bytes;
  CPU_INT32U wr_data;
  CPU_INT32U wr_len;
  CPU_INT08U dummy_bytes;

  //                                                               ------------------ COMMAND SETUP -------------------
  reg_val = p_cmd->Opcode << FS_QSPI_REG_FLASHCMDCTRL_OPCODE_OFFSET;
  //                                                               Configure start address if needed.
  if (p_cmd->Form.HasAddr) {
    if (p_cmd->Form.AddrLen4Bytes) {                            // 4-byte address.
      addr_bytes = 4u;
    } else {                                                    // 3-byte address.
      addr_bytes = 3u;
    }
    //                                                             Address in little endian fmt on QSPI data line.
    MEM_VAL_COPY_SET_INTU_LITTLE(&flash_addr, &addr_tbl[0u], addr_bytes);
    p_reg->FLASHCMDADDR = flash_addr;

    DEF_BIT_SET(reg_val, ((addr_bytes - 1) << FS_QSPI_REG_FLASHCMDCTRL_NBR_ADDR_BYTES_OFFSET));
    DEF_BIT_SET(reg_val, FS_QSPI_REG_FLASHCMDCTRL_CMD_ADDR_EN_MSK);
  }
  //                                                               Set dummy bytes.
  dummy_bytes = inter_cycles / FS_QSPI_DUMMY_CYCLES_PER_BYTE;
  if ((inter_cycles % FS_QSPI_DUMMY_CYCLES_PER_BYTE) != 0) {
    dummy_bytes += 1u;
  }
  reg_val |= (dummy_bytes << FS_QSPI_REG_FLASHCMDCTRL_DUMMY_BYTES_OFFSET) & FS_QSPI_REG_FLASHCMDCTRL_DUMMY_BYTES_MSK;

  //                                                               -------------------- DATA WRITE --------------------
  if (xfer_size) {
    DEF_BIT_SET(reg_val, FS_QSPI_REG_FLASHCMDCTRL_WR_DATA_EN_MSK);
    //                                                             Write data size is 0-based. 0 means 1 byte and so on.
    reg_val |= (((xfer_size - 1) << FS_QSPI_REG_FLASHCMDCTRL_WR_DATA_BYTES_OFFSET) & FS_QSPI_REG_FLASHCMDCTRL_WR_DATA_BYTES_MSK);
    //                                                             Write lower 4 bytes.
    wr_len = xfer_size > 4 ? 4 : xfer_size;
    Mem_Copy(&wr_data,
             p_tx_buf08,
             wr_len);
    p_reg->FLASHWRDATALOWER = wr_data;

    if (xfer_size > 4) {                                        // Write upper 4 bytes.
      p_tx_buf08 += wr_len;
      wr_len = xfer_size - wr_len;
      Mem_Copy(&wr_data,
               p_tx_buf08,
               wr_len);
      p_reg->FLASHWRDATAUPPER = wr_data;
    }
  }
  //                                                               ---------------- COMMAND EXECUTION -----------------
  FS_NOR_QuadSPI_StigCmdFlashExec(p_drv_data,
                                  reg_val,
                                  p_err);
}

/****************************************************************************************************//**
 *                                       FS_NOR_QuadSPI_StigCmdFlashExec()
 *
 * @brief    Execute NOR command using the Software Triggered Instruction Generator (STIG) registers.
 *
 * @param    p_drv_data  Pointer to driver-specific data.
 *
 * @param    reg_val     Value to write in the register 'flashcmd'.
 *
 * @param    p_err       Error pointer.
 *******************************************************************************************************/
static void FS_NOR_QuadSPI_StigCmdFlashExec(const QSPI_DATA *p_drv_data,
                                            CPU_INT32U      reg_val,
                                            RTOS_ERR        *p_err)
{
  QSPI_REG   *p_reg = (QSPI_REG *)p_drv_data->QuadSPI_CtrlrInfoPtr->BaseAddr;
  CPU_INT32U retry;

  //                                                               Configure register without starting cmd execution.
  p_reg->FLASHCMDCTRL = reg_val;
  //                                                               Start command execution.
  DEF_BIT_SET(reg_val, FS_QSPI_REG_FLASHCMDCTRL_EXEC_CMD_MASK);
  p_reg->FLASHCMDCTRL = reg_val;

