espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/micrium_os/drivers/fs/source/fs_nor_quad_spi_drv_silabs_efm32gg11.c
  retry = FS_QSPI_REG_RETRY2_MAX;
  while (retry > 0u) {                                          // Poll until command execution has finished.
    reg_val = p_reg->FLASHCMDCTRL;
    if (DEF_BIT_IS_CLR(reg_val, FS_QSPI_REG_FLASHCMDCTRL_EXEC_CMD_STATUS_MASK)) {
      break;
    }

    KAL_Dly(1);
    retry--;
  }

  if (retry == 0u) {
    RTOS_ERR_SET(*p_err, RTOS_ERR_IO);
    return;
  }

  FS_NOR_QuadSPI_IdleCheck(p_drv_data, p_err);                  // Poll QSPI idle status to ensure QSPI has finished.
}

/****************************************************************************************************//**
 *                                       FS_NOR_QuadSPI_IdleCheck()
 *
 * @brief    Ensure QSPI controller is idle before executing next NOR command or verifying some
 *           controller's status.
 *
 * @param    p_drv_data  Pointer to driver-specific data.
 *
 * @param    p_err       Error pointer.
 *******************************************************************************************************/
static void FS_NOR_QuadSPI_IdleCheck(const QSPI_DATA *p_drv_data,
                                     RTOS_ERR        *p_err)
{
  QSPI_REG   *p_reg = (QSPI_REG *)p_drv_data->QuadSPI_CtrlrInfoPtr->BaseAddr;
  CPU_INT32U idle_cnt = 0u;
  CPU_INT32U retry_cnt = 0u;
  CPU_INT32U reg_val;

  while ((idle_cnt < FS_QSPI_IDLE_CNT_MAX)
         && (retry_cnt < FS_QSPI_REG_RETRY1_MAX)) {
    reg_val = p_reg->CONFIG;
    if (DEF_BIT_IS_SET(reg_val, FS_QSPI_REG_CONFIG_IDLE_MSK)) {
      idle_cnt++;
    } else {
      idle_cnt = 0;
      retry_cnt++;
    }
  }

  if (retry_cnt == FS_QSPI_REG_RETRY1_MAX) {
    LOG_ERR(("QSPI still busy after flash cmd execution completion."));
    RTOS_ERR_SET(*p_err, RTOS_ERR_IO);
  }
}

/****************************************************************************************************//**
 *                                       FS_NOR_QuadSPI_IndirectRd()
 *
 * @brief    Perform a NOR read command using the indirect access controller module.
 *
 * @param    p_drv_data      Pointer to driver-specific data.
 *
 * @param    p_cmd           Pointer to command descriptor for command to send.
 *
 * @param    addr_tbl        Array of address octets, in MSB order.
 *
 * @param    inter_cycles    Number of intermediate data CYCLES to insert between address and data
 *                           phases.
 *
 * @param    p_xfer_data     Pointer to transfer buffer.
 *
 * @param    xfer_size       Size of transfer, in octets.
 *
 * @param    p_err           Error pointer.
 *
 * @note     (1) This function handles the following read transactions:
 *               - (a) OPCODE + ADDR + DATA
 *               - (b) OPCODE + DATA (if DATA > 8 bytes)
 *******************************************************************************************************/
static void FS_NOR_QuadSPI_IndirectRd(const QSPI_DATA                *p_drv_data,
                                      const FS_NOR_QUAD_SPI_CMD_DESC *p_cmd,
                                      CPU_INT08U                     addr_tbl[],
                                      CPU_INT08U                     inter_cycles,
                                      void                           *p_xfer_data,
                                      CPU_INT32U                     xfer_size,
                                      RTOS_ERR                       *p_err)
{
  QSPI_REG   *p_reg = (QSPI_REG *)p_drv_data->QuadSPI_CtrlrInfoPtr->BaseAddr;
  CPU_INT32U reg_val = 0u;
  CPU_INT32U flash_addr = 0u;
  CPU_INT08U addr_bytes;
  CPU_INT08U io_mode;

  //                                                               -------------------- READ SETUP --------------------
  //                                                               Configure SRAM partition for read.
  p_reg->SRAMPARTITIONCFG = (FS_QSPI_SRAM_PARTITION_RD_SIZE_LOC_QTY - 1u); // -1 because reg val is 0-based.
  //                                                               Setup the indirect trigger address.
  p_reg->INDAHBADDRTRIGGER = FS_QSPI_SRAM_FIFO_START_ADDR_SEL;
  p_reg->INDIRECTTRIGGERADDRRANGE = 0u;
  //                                                               Instruction transferred on DQ0 (1 bit).
  DEF_BIT_FIELD_WR(reg_val, FS_QSPI_XFER_MODE_SINGLE_IO, FS_QSPI_REG_DEVINSTRRDCONFIG_INST_WIDTH_MSK);
  //                                                               Configure the opcode.
  DEF_BIT_FIELD_WR(reg_val, p_cmd->Opcode, FS_QSPI_REG_DEVINSTRRDCONFIG_OPCODE_MSK);

  //                                                               Configure start address for indirect read.
  if (p_cmd->Form.AddrLen4Bytes) {                              // 4-byte address.
    addr_bytes = 4u;
  } else {                                                      // 3-byte address.
    addr_bytes = 3u;
  }
  //                                                               Address in little endian fmt on QSPI data line.
  MEM_VAL_COPY_SET_INTU_LITTLE(&flash_addr, &addr_tbl[0u], addr_bytes);
  p_reg->INDIRECTREADXFERSTART = flash_addr;
  //                                                               Set read address transfer width.
  if (p_cmd->Form.AddrMultiIO == DEF_YES) {                     // Read address transferred on DQ0, DQ1, DQ2 and DQ3.
    io_mode = FS_QSPI_XFER_MODE_QUAD_IO;
  } else {                                                      // Read address transferred on DQ0.
    io_mode = FS_QSPI_XFER_MODE_SINGLE_IO;
  }
  DEF_BIT_FIELD_WR(reg_val, io_mode, FS_QSPI_REG_DEVINSTRRDCONFIG_ADDR_WIDTH_MSK);
  //                                                               Set read data transfer width.
  if (p_cmd->Form.DataMultiIO == DEF_YES) {                     // Read data transferred on DQ0, DQ1, DQ2 and DQ3.
    io_mode = FS_QSPI_XFER_MODE_QUAD_IO;
  } else {                                                      // Read data transferred on DQ0.
    io_mode = FS_QSPI_XFER_MODE_SINGLE_IO;
  }
  DEF_BIT_FIELD_WR(reg_val, io_mode, FS_QSPI_REG_DEVINSTRRDCONFIG_DATA_WIDTH_MSK);

