espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/micrium_os/drivers/fs/source/fs_nor_quad_spi_drv_silabs_efm32gg11.c
  //                                                               Set dummy cycles.
  if (inter_cycles > FS_QSPI_REG_DEVINSTRRDCONFIG_DUMMY_CLK_CYCLES_MAX) {
    inter_cycles = FS_QSPI_REG_DEVINSTRRDCONFIG_DUMMY_CLK_CYCLES_MAX;
  }
  DEF_BIT_FIELD_WR(reg_val, inter_cycles, FS_QSPI_REG_DEVINSTRRDCONFIG_DUMMY_CLK_CYCLES_MSK);

  p_reg->DEVINSTRRDCONFIG = reg_val;                            // Set Device Read reg with configured value.

  //                                                               Set nbr of addr bytes.
  DEF_BIT_FIELD_WR(p_reg->DEVSIZECONFIG, (addr_bytes - 1), FS_QSPI_REG_DEVSIZECONFIG_NBR_ADDR_MASK);

  //                                                               ------------------ READ EXECUTION ------------------
  p_reg->INDIRECTREADXFERNUMBYTES = xfer_size;                  // Set read xfer cnt.
                                                                // Start the indirect read transfer.
  DEF_BIT_SET(p_reg->INDIRECTREADXFERCTRL, FS_QSPI_REG_INDIRECTREADXFERCTRL_START_MASK);
  //                                                               Read data from flash device.
  FS_NOR_QuadSPI_IndirectRd_SRAM(p_drv_data,
                                 p_xfer_data,
                                 (const void *)FS_QSPI_SRAM_FIFO_START_ADDR_SEL,
                                 xfer_size,
                                 p_err);
  if (RTOS_ERR_CODE_GET(*p_err) != RTOS_ERR_NONE) {
    LOG_ERR(("Indirect read: reading data from flash failed with error ", (u)RTOS_ERR_CODE_GET(*p_err)));
  }
}

/****************************************************************************************************//**
 *                                       FS_NOR_QuadSPI_IndirectRd_SRAM()
 *
 * @brief    Read data from SRAM. Indirect access controller has received data from the flash device
 *           and stored them in SRAM.
 *
 * @param    p_drv_data  Pointer to driver-specific data.
 *
 * @param    p_dest_buf  Pointer to receive buffer.
 *
 * @param    p_src_sram  Pointer to source SRAM FIFO address.
 *
 * @param    xfer_size   Size of transfer, in octets.
 *
 * @param    p_err       Error pointer.
 *
 * @note     (1) When a read transfer is in progress, 3 situations can occur:
 *               - (a) Transfer size < SRAM FIFO size: reading register SRAMFILL indicates the number of
 *                     bytes received from flash.
 *               - (b) Transfer size = SRAM FIFO size: reading register SRAMFILL indicates the number of
 *                     bytes received from flash.
 *               - (c) Transfer size > SRAM FIFO size: the bit SRAMFULL in register INDIRECTREADXFERCTRL
 *                     specifies the SRAM is full. Thus the total SRAM read partition size indicates the
 *                     number of bytes received from flash. When the SRAM is full, the register SRAMFILL
 *                     is not updated to the maximum read locations.
 *
 * @note     (2) The Indirect AHB Address Trigger register (INDAHBADDRTRIGGER) allows to read a SRAM
 *               FIFO location of the QSPI controller. By configuring the proper trigger address in
 *               this register, the CPU can perform a SRAM read by directly dereferencing the address
 *               configured in the register. This will provoke an AHB read from the Data Slave
 *               Controller of QSPI (slave interface) to the CPU (master interface). Then the CPU
 *               copies the read data to the provided receive buffer.
 *******************************************************************************************************/
static void FS_NOR_QuadSPI_IndirectRd_SRAM(const QSPI_DATA *p_drv_data,
                                           void            *p_dest_buf,
                                           const void      *p_src_sram,
                                           CPU_INT32U      xfer_size,
                                           RTOS_ERR        *p_err)
{
  QSPI_REG    *p_reg = (QSPI_REG *)p_drv_data->QuadSPI_CtrlrInfoPtr->BaseAddr;
  CPU_INT32U  *p_dest_buf32 = (CPU_INT32U *)p_dest_buf;
  CPU_INT32U  xfer_rem_size = xfer_size;
  CPU_INT32U  retry;
  CPU_INT32U  sram_fill_level = 0u;
  CPU_INT32U  sram_fill_threshold;
  CPU_INT32U  sram_entry_cnt;
  CPU_BOOLEAN clr_sram_full = DEF_NO;
  CPU_INT32U  dev_rd_reg = 0u;

  //                                                               Compute nbr of 32-bit locations for this xfer.
  sram_entry_cnt = xfer_size / FS_QSPI_SRAM_LOC_SIZE_BYTE;
  if ((xfer_size % FS_QSPI_SRAM_LOC_SIZE_BYTE) != 0) {
    sram_entry_cnt += 1;
  }

  while (xfer_rem_size > 0u) {                                  // Read entire xfer.
                                                                // Wait SRAM to be filled with enough data from flash.
    sram_fill_threshold = DEF_MIN(FS_QSPI_SRAM_PARTITION_RD_SIZE_LOC_QTY, sram_entry_cnt);
    retry = FS_QSPI_REG_RETRY2_MAX;
    while (retry > 0u) {
      if (DEF_BIT_IS_SET(p_reg->INDIRECTREADXFERCTRL, FS_QSPI_REG_INDIRECTREADXFERCTRL_SRAM_FULL_MASK)) {
        sram_fill_level = sram_fill_threshold;                  // If SRAM full, set the fill level by sw (see Note #1).
        clr_sram_full = DEF_YES;
      } else {
        sram_fill_level = p_reg->SRAMFILL & FS_QSPI_REG_SRAMFILL_INDRDPART_MASK;
      }
      if (sram_fill_level == sram_fill_threshold) {
        break;
      }
      retry--;
    }

    if (retry == 0u) {
      LOG_ERR(("Indirect read: not enough data in SRAM after polling for ", (u)FS_QSPI_REG_RETRY2_MAX, " times"));
      RTOS_ERR_SET(*p_err, RTOS_ERR_IO);
      return;
    }

    while (sram_fill_level) {                                   // Read 1 chunk of SRAM (= part of xfer).
                                                                // 32-bit word read.
      if (xfer_rem_size >= FS_QSPI_SRAM_LOC_SIZE_BYTE) {
        *p_dest_buf32 = *(CPU_INT32U *)p_src_sram;              // See Note #2.
        xfer_rem_size -= FS_QSPI_SRAM_LOC_SIZE_BYTE;
        p_dest_buf32++;
      } else {                                                  // Last 32-bit word read.
        CPU_INT32U last_data32 = 0u;

        last_data32 = *(CPU_INT32U *)p_src_sram;
        Mem_Copy((void *)p_dest_buf32,
                 (void *)&last_data32,
                 xfer_rem_size);
        xfer_rem_size -= xfer_rem_size;
      }
      sram_entry_cnt--;
      sram_fill_level--;
    }
  }

