espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/micrium_os/drivers/fs/source/fs_nor_quad_spi_drv_silabs_efm32gg11.c
  //                                                               Check if indirect read done.
  dev_rd_reg = p_reg->INDIRECTREADXFERCTRL;
  if (!DEF_BIT_IS_SET(dev_rd_reg, FS_QSPI_REG_INDIRECTREADXFERCTRL_OP_DONE_MASK)) {
    LOG_ERR(("Indirect read: reading data OK but indirect operation still indicated as not done, dev_rd_reg = ", (X)dev_rd_reg));
    RTOS_ERR_SET(*p_err, RTOS_ERR_IO);
    goto rd_err;
  }
  if (clr_sram_full) {                                          // If SRAM was full, clear the indicator flag.
    DEF_BIT_SET(dev_rd_reg, FS_QSPI_REG_INDIRECTREADXFERCTRL_SRAM_FULL_MASK);
  }
  //                                                               Clear indirect completion status.
  DEF_BIT_SET(dev_rd_reg, FS_QSPI_REG_INDIRECTREADXFERCTRL_OP_DONE_MASK);
  p_reg->INDIRECTREADXFERCTRL = dev_rd_reg;
  return;

rd_err:
  //                                                               Cancel the indirect read.
  DEF_BIT_SET(p_reg->INDIRECTREADXFERCTRL, FS_QSPI_REG_INDIRECTREADXFERCTRL_CANCEL_MASK);
}

/****************************************************************************************************//**
 *                                           FS_NOR_QuadSPI_DirectRd()
 *
 * @brief    Perform a NOR read command using the direct access controller module.
 *
 * @param    p_drv_data      Pointer to driver-specific data.
 *
 * @param    p_cmd           Pointer to command descriptor for command to send.
 *
 * @param    addr_tbl        Array of address octets, in MSB order.
 *
 * @param    p_xfer_data     Pointer to transfer buffer.
 *
 * @param    xfer_size       Size of transfer, in octets.
 *
 * @param    p_err           Error pointer.
 *
 * @note     (1) In direct mode, the flash address must be absolute as opposed to relative address
 *               used in indirect mode. That is the absolute mode is formed from the base address
 *               assigned to the flash device in the CPU memory space to which the address relative
 *               to flash device address range is added. For example, if the flash device base address
 *               in CPU memory is 0XC0000000 and the flash relative address is 0x100, then the
 *               absolute address is 0xC0000100.
 *******************************************************************************************************/
static void FS_NOR_QuadSPI_DirectRd(const QSPI_DATA                *p_drv_data,
                                    const FS_NOR_QUAD_SPI_CMD_DESC *p_cmd,
                                    CPU_INT08U                     addr_tbl[],
                                    void                           *p_xfer_data,
                                    CPU_INT32U                     xfer_size,
                                    RTOS_ERR                       *p_err)
{
  CPU_ADDR   flash_addr = 0u;
  CPU_INT08U addr_bytes;

  PP_UNUSED_PARAM(p_err);

  //                                                               Configure start address for direct read.
  if (p_cmd->Form.AddrLen4Bytes) {                              // 4-byte address.
    addr_bytes = 4u;
  } else {                                                      // 3-byte address.
    addr_bytes = 3u;
  }
  //                                                               Form absolute flash addr (see Note #1).
  MEM_VAL_COPY_SET_INTU_LITTLE(&flash_addr, &addr_tbl[0u], addr_bytes);
  flash_addr += p_drv_data->QuadSPI_CtrlrInfoPtr->FlashMemMapStartAddr;

  Mem_Copy(p_xfer_data,
           (void *)flash_addr,
           xfer_size);
}

/****************************************************************************************************//**
 *                                       FS_NOR_QuadSPI_IndirectWr()
 *
 * @brief    Perform a NOR write command using the indirect access controller module.
 *
 * @param    p_drv_data      Pointer to driver-specific data.
 *
 * @param    p_cmd           Pointer to command descriptor for command to send.
 *
 * @param    addr_tbl        Array of address octets, in MSB order.
 *
 * @param    inter_cycles    Number of intermediate data CYCLES to insert between address and data
 *                           phases.
 *
 * @param    p_xfer_data     Pointer to transfer buffer.
 *
 * @param    xfer_size       Size of transfer, in octets.
 *
 * @param    p_err           Error pointer.
 *
 * @note     (1) The instruction width for write commands is set in the register Device Read
 *               Instruction Configuration (DEVINSTRRDCONFIG) and not in the register Device Write
 *               Instruction Configuration (DEVINSTRWRCONFIG).
 *******************************************************************************************************/
static void FS_NOR_QuadSPI_IndirectWr(const QSPI_DATA                *p_drv_data,
                                      const FS_NOR_QUAD_SPI_CMD_DESC *p_cmd,
                                      CPU_INT08U                     addr_tbl[],
                                      CPU_INT08U                     inter_cycles,
                                      void                           *p_xfer_data,
                                      CPU_INT32U                     xfer_size,
                                      RTOS_ERR                       *p_err)
{
  QSPI_REG   *p_reg = (QSPI_REG *)p_drv_data->QuadSPI_CtrlrInfoPtr->BaseAddr;
  CPU_INT32U reg_val = 0u;
  CPU_INT32U flash_addr = 0u;
  CPU_INT08U addr_bytes;
  CPU_INT08U io_mode;
  CPU_INT32U retry;

  //                                                               ------------------- WRITE SETUP --------------------
  //                                                               Configure SRAM partition for write.
  p_reg->SRAMPARTITIONCFG = FS_QSPI_SRAM_PARTITION_WR_SIZE_RD_LOC_QTY;
  //                                                               Setup the indirect trigger address.
  p_reg->INDAHBADDRTRIGGER = FS_QSPI_SRAM_FIFO_START_ADDR_SEL;
  p_reg->INDIRECTTRIGGERADDRRANGE = 0u;
  //                                                               Instruction transferred on DQ0 (see Note #1).
  DEF_BIT_FIELD_WR(p_reg->DEVINSTRRDCONFIG, FS_QSPI_XFER_MODE_SINGLE_IO, FS_QSPI_REG_DEVINSTRRDCONFIG_INST_WIDTH_MSK);
  //                                                               Configure the opcode.
  DEF_BIT_FIELD_WR(reg_val, p_cmd->Opcode, FS_QSPI_REG_DEVINSTRWRCONFIG_OPCODE_MSK);

  //                                                               Configure start address for indirect write.
  if (p_cmd->Form.AddrLen4Bytes) {                              // 4-byte address.
    addr_bytes = 4u;
  } else {                                                      // 3-byte address.
    addr_bytes = 3u;
  }
  //                                                               Address in little endian fmt on QSPI data line.
  MEM_VAL_COPY_SET_INTU_LITTLE(&flash_addr, &addr_tbl[0u], addr_bytes);
  p_reg->INDIRECTWRITEXFERSTART = flash_addr;
  //                                                               Set write address transfer width.
  if (p_cmd->Form.AddrMultiIO == DEF_YES) {                     // Write address transferred on DQ0, DQ1, DQ2 and DQ3.
    io_mode = FS_QSPI_XFER_MODE_QUAD_IO;
  } else {                                                      // Write address transferred on DQ0.
    io_mode = FS_QSPI_XFER_MODE_SINGLE_IO;
  }
  DEF_BIT_FIELD_WR(reg_val, io_mode, FS_QSPI_REG_DEVINSTRWRCONFIG_ADDR_WIDTH_MSK);
  //                                                               Set write data transfer width.
  if (p_cmd->Form.DataMultiIO == DEF_YES) {                     // Write data transferred on DQ0, DQ1, DQ2 and DQ3.
    io_mode = FS_QSPI_XFER_MODE_QUAD_IO;
  } else {                                                      // Write data transferred on DQ0.
    io_mode = FS_QSPI_XFER_MODE_SINGLE_IO;
  }
  DEF_BIT_FIELD_WR(reg_val, io_mode, FS_QSPI_REG_DEVINSTRWRCONFIG_DATA_WIDTH_MSK);
  //                                                               Set dummy cycles.

  if (inter_cycles > FS_QSPI_REG_DEVINSTRWRCONFIG_DUMMY_CLK_CYCLES_MAX) {
    inter_cycles = FS_QSPI_REG_DEVINSTRWRCONFIG_DUMMY_CLK_CYCLES_MAX;
  }
  DEF_BIT_FIELD_WR(reg_val, inter_cycles, FS_QSPI_REG_DEVINSTRWRCONFIG_DUMMY_CLK_CYCLES_MSK);

  p_reg->DEVINSTRWRCONFIG = reg_val;                            // Set Device Write reg with configured value.

  //                                                               Set nbr of addr bytes.
  DEF_BIT_FIELD_WR(p_reg->DEVSIZECONFIG, (addr_bytes - 1), FS_QSPI_REG_DEVSIZECONFIG_NBR_ADDR_MASK);

  //                                                               ----------------- WRITE EXECUTION ------------------
  p_reg->INDIRECTWRITEXFERNUMBYTES = xfer_size;                 // Set write xfer cnt.
                                                                // Start the indirect write transfer.
  DEF_BIT_SET(p_reg->INDIRECTWRITEXFERCTRL, FS_QSPI_REG_INDIRECTWRITEXFERCTRL_START_MASK);
  //                                                               Write data to flash device.
  FS_NOR_QuadSPI_IndirectWr_SRAM(p_drv_data,
                                 (const void *)FS_QSPI_SRAM_FIFO_START_ADDR_SEL,
                                 p_xfer_data,
                                 xfer_size,
                                 p_err);
  if (RTOS_ERR_CODE_GET(*p_err) != RTOS_ERR_NONE) {
    LOG_ERR(("Indirect write: writing to flash failed with error ", (u)RTOS_ERR_CODE_GET(*p_err)));
    goto wr_err;
  }
  //                                                               Check flash indirect controller status.
  retry = FS_QSPI_REG_RETRY1_MAX;
  while (retry > 0u) {
    reg_val = p_reg->INDIRECTWRITEXFERCTRL;
    if (DEF_BIT_IS_SET(reg_val, FS_QSPI_REG_INDIRECTWRITEXFERCTRL_OP_DONE_MASK)) {
      break;
    }
    KAL_Dly(1);
    retry--;
  }
  if (retry == 0u) {
    LOG_ERR(("Indirect write: writing data OK but indirect operation still indicated as not done, dev_wr_reg = ", (X)reg_val));
    RTOS_ERR_SET(*p_err, RTOS_ERR_IO);
    goto wr_err;
  }
  //                                                               Clear indirect completion status.
  DEF_BIT_SET(p_reg->INDIRECTWRITEXFERCTRL, FS_QSPI_REG_INDIRECTWRITEXFERCTRL_OP_DONE_MASK);
  return;

wr_err:
  //                                                               Cancel the indirect write.
  DEF_BIT_SET(p_reg->INDIRECTWRITEXFERCTRL, FS_QSPI_REG_INDIRECTWRITEXFERCTRL_CANCEL_MASK);
}

/****************************************************************************************************//**
 *                                       FS_NOR_QuadSPI_IndirectWr_SRAM()
 *
 * @brief    Write data to SRAM. Indirect access controller will then write these data to the flash
 *           device.
 *
 * @param    p_drv_data      Pointer to driver-specific data.
 *
 * @param    p_dest_sram     Pointer to source SRAM FIFO address.
 *
 * @param    p_src_buf       Pointer to transmit buffer.
 *
 * @param    xfer_size       Size of transfer, in octets.
 *
 * @param    p_err           Error pointer.
 *
 * @note     (1) The Indirect AHB Address Trigger register (INDAHBADDRTRIGGER) allows to write a SRAM
 *               location of the QSPI controller. By configuring the proper trigger address in this
 *               register, the CPU can perform a SRAM write by directly dereferencing the address
 *               configured in the register. This will provoke an AHB write from the CPU (master
 *               interface) to the Data Slave Controller of QSPI (slave interface). Then data will be
 *               written to the SRAM.
 *******************************************************************************************************/
static void FS_NOR_QuadSPI_IndirectWr_SRAM(const QSPI_DATA *p_drv_data,
                                           const void      *p_dest_sram,
                                           void            *p_src_buf,
                                           CPU_INT32U      xfer_size,
                                           RTOS_ERR        *p_err)
{
  QSPI_REG   *p_reg = (QSPI_REG *)p_drv_data->QuadSPI_CtrlrInfoPtr->BaseAddr;
  CPU_INT32U *p_src_buf32 = (CPU_INT32U *)p_src_buf;
  CPU_INT32U *p_dest_fifo32 = (CPU_INT32U *)p_dest_sram;        // See Note #1.
  CPU_INT32U xfer_rem_size = xfer_size;
  CPU_INT32U sram_fill_level;
  CPU_INT32U sram_entry_avail;
  CPU_INT32U sram_bytes_avail;
  CPU_INT32U wr_bytes;
  CPU_INT32U retry;
  CPU_INT32U page_size;

  page_size = DEF_BIT_FIELD_RD(p_reg->DEVSIZECONFIG, FS_QSPI_REG_DEVSIZECONFIG_PAGE_SIZE_MASK);

