espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/micrium_os/drivers/fs/source/fs_nor_quad_spi_drv_silabs_efm32gg11.c
  while (xfer_rem_size > 0u) {
    //                                                             Write a page or remaining bytes.
    wr_bytes = DEF_MIN(page_size, xfer_rem_size);

    //                                                             Wait SRAM to be enough empty to send data to flash.
    retry = FS_QSPI_REG_RETRY2_MAX;
    while (retry > 0u) {
      sram_fill_level = DEF_BIT_FIELD_RD(p_reg->SRAMFILL, FS_QSPI_REG_SRAMFILL_INDWRPART_MASK);
      sram_entry_avail = FS_QSPI_SRAM_PARTITION_WR_SIZE_LOC_QTY_REAL - sram_fill_level;
      sram_bytes_avail = sram_entry_avail * FS_QSPI_SRAM_LOC_SIZE_BYTE;

      if (sram_bytes_avail >= wr_bytes) {
        break;
      }
      retry--;
    }
    if (retry == 0u) {
      LOG_ERR(("Indirect write: not enough room in SRAM after polling for ", (u)FS_QSPI_REG_RETRY2_MAX, " times"));
      RTOS_ERR_SET(*p_err, RTOS_ERR_IO);
      return;
    }

    while (wr_bytes > 0u) {
      //                                                           32-bit word write.
      if (wr_bytes >= FS_QSPI_SRAM_LOC_SIZE_BYTE) {
        *p_dest_fifo32 = *p_src_buf32;

        wr_bytes -= FS_QSPI_SRAM_LOC_SIZE_BYTE;
        xfer_rem_size -= FS_QSPI_SRAM_LOC_SIZE_BYTE;
        p_src_buf32++;
      } else {                                                  // Last 32-bit word write.
        CPU_INT32U last_data32 = 0u;

        Mem_Copy((void *)&last_data32,
                 (void *)p_src_buf32,
                 wr_bytes);
        *p_dest_fifo32 = last_data32;
        xfer_rem_size -= wr_bytes;
        wr_bytes -= wr_bytes;
      }
    }
  }
  //                                                               Wait until last write is completed (FIFO empty).
  retry = FS_QSPI_REG_RETRY1_MAX;
  while (retry > 0u) {
    sram_fill_level = DEF_BIT_FIELD_RD(p_reg->SRAMFILL, FS_QSPI_REG_SRAMFILL_INDWRPART_MASK);
    if (sram_fill_level == 0) {
      break;
    }
    KAL_Dly(1);
    retry--;
  }
  if (retry == 0u) {
    LOG_ERR(("Indirect write: last write did not complete after ", (u)FS_QSPI_REG_RETRY1_MAX, " retries"));
    RTOS_ERR_SET(*p_err, RTOS_ERR_IO);
  }
}

/****************************************************************************************************//**
 *                                           FS_NOR_QuadSPI_DirectWr()
 *
 * @brief    Perform a NOR write command using the direct access controller module.
 *
 * @param    p_drv_data      Pointer to driver-specific data.
 *
 * @param    p_cmd           Pointer to command descriptor for command to send.
 *
 * @param    addr_tbl        Array of address octets, in MSB order.
 *
 * @param    p_xfer_data     Pointer to transfer buffer.
 *
 * @param    xfer_size       Size of transfer, in octets.
 *
 * @param    p_err           Error pointer.
 *
 * @note     (1) See Note #1 of FS_NOR_QuadSPI_DirectRd().
 *
 * @note     (2) The Quad SPI controller documentation indicates the following for direct writes:
 *               "The page boundary detection is only guaranteed for word (4-byte) aligned accesses.
 *               It is therefore recommended to ensure that all writes are word aligned".
 *               When a flash address not aligned is detected, a logic is implemented to handle this
 *               unaligned direct write so that an aligned write is performed.
 *******************************************************************************************************/
static void FS_NOR_QuadSPI_DirectWr(const QSPI_DATA                *p_drv_data,
                                    const FS_NOR_QUAD_SPI_CMD_DESC *p_cmd,
                                    CPU_INT08U                     addr_tbl[],
                                    void                           *p_xfer_data,
                                    CPU_INT32U                     xfer_size,
                                    RTOS_ERR                       *p_err)
{
  CPU_ADDR   flash_addr = 0u;
  CPU_INT08U addr_bytes;

  PP_UNUSED_PARAM(p_err);

  //                                                               Configure start address for direct read.
  if (p_cmd->Form.AddrLen4Bytes) {                              // 4-byte address.
    addr_bytes = 4u;
  } else {                                                      // 3-byte address.
    addr_bytes = 3u;
  }
  //                                                               Form absolute flash addr (see Note #1).
  MEM_VAL_COPY_SET_INTU_LITTLE(&flash_addr, &addr_tbl[0u], addr_bytes);
  flash_addr += p_drv_data->QuadSPI_CtrlrInfoPtr->FlashMemMapStartAddr;

  Mem_Copy((void *)flash_addr,
           p_xfer_data,
           xfer_size);
}

/********************************************************************************************************
 ********************************************************************************************************
 *                                   DEPENDENCIES & AVAIL CHECK(S) END
 ********************************************************************************************************
 *******************************************************************************************************/

#endif // RTOS_MODULE_FS_NOR_AVAIL
